app/Controllers/AdminController.php


        // Últimos pedidos
        $db = \Config\Database::connect();
        $ultimosPedidos = $db->table('invoice i')
            ->select('i.*, u.fname as nombre, u.lname as apellido')
            ->join('user u', 'i.user_id = u.user_id')
            ->orderBy('i.created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `i`.*, `u`.`fname` as `nombre`, `u`.`lname` as `apellido`
FROM `invoice` `i`
JOIN `user` `u` ON `i`.`user_id` = `u`.`user_id`
ORDER BY `i`.`created_at` DESC
 LIMIT 5