app/Controllers/AdminController.php

    public function index()
    {
        $usuarios = new UserModel();
        $productos = new ProductModel();
        $facturas  = new InvoiceModel();
        $consultas = new InquiryModel();
        $contactos = new ContactModel();
        $wishlist  = new WishItemModel();

        $ingresos = $facturas->selectSum('total')->first();
        $ingresosTotales = isset($ingresos['total']) ? $ingresos['total'] : 0;
        $cantidadClientes = $usuarios->where('role', 'user')->where('deleted_at', null)->countAllResults();
        $cantidadPedidos = $facturas->countAllResults();
        $pendientesEnvio = 0;

        $ventasRaw = $facturas->select("DATE(created_at) as fecha, SUM(total) as total")
            ->where("created_at >=", date('Y-m-d', strtotime('-6 days')))
            ->groupBy("DATE(created_at)")
            ->orderBy("fecha", "ASC")
            ->get()
            ->getResultArray();
---
SELECT SUM(`total`) AS `total`
FROM `invoice`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'user'
AND `deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `invoice`
SELECT COUNT(*) AS `numrows`
FROM `invoice`
WHERE DATE(created_at) = '2025-06-24'
SELECT DATE(created_at) as fecha, SUM(total) as total
FROM `invoice`
WHERE `created_at` >= '2025-06-10'
GROUP BY DATE(created_at)
ORDER BY `fecha` ASC

        ];

        $db = \Config\Database::connect();
        $ultimosPedidos = $db->table('invoice i')
            ->select('i.*, u.fname as nombre, u.lname as apellido')
            ->join('user u', 'i.user_id = u.user_id')
            ->orderBy('i.created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `i`.*, `u`.`fname` as `nombre`, `u`.`lname` as `apellido`
FROM `invoice` `i`
JOIN `user` `u` ON `i`.`user_id` = `u`.`user_id`
ORDER BY `i`.`created_at` DESC
 LIMIT 5

    public function verPedido($id)
    {
        $db = \Config\Database::connect();
        $pedido = $db->table('invoice i')
            ->select('i.*, u.fname as nombre, u.lname as apellido, u.mail')
            ->join('user u', 'i.user_id = u.user_id')
            ->where('i.invoice_id', $id)
            ->get()
            ->getRowArray();

        $productos = $db->table('invoice_item ii')
            ->select('ii.*, p.name, p.image, p.description')
            ->join('product p', 'ii.product_id = p.product_id')
            ->where('ii.invoice_id', $id)
            ->get()
            ->getResultArray();
---
SELECT `i`.*, `u`.`fname` as `nombre`, `u`.`lname` as `apellido`, `u`.`mail`
FROM `invoice` `i`
JOIN `user` `u` ON `i`.`user_id` = `u`.`user_id`
WHERE `i`.`invoice_id` = '3'
SELECT `ii`.*, `p`.`name`, `p`.`image`, `p`.`description`
FROM `invoice_item` `ii`
JOIN `product` `p` ON `ii`.`product_id` = `p`.`product_id`
WHERE `ii`.`invoice_id` = '3'