app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `mail` = 'pepe1@gmail.com'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
    public function process_login()
    {
        $session = session();
        $userModel = new \App\Models\UserModel();

        $email = $this->request->getPost('mail');
        $password = $this->request->getPost('password');

        $user = $userModel->where('mail', $email)->first();