app/Controllers/CarritoController.php

SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
AND `product`.`product_id` = '3'
---
    public function agregar()
    {
        $product_id = $this->request->getPost('product_id');
        $quantity = (int) $this->request->getPost('quantity');

        $user_id = session()->get('user_id');
        $cartModel = new \App\Models\CartItemModel();
        $productModel = new \App\Models\ProductModel();

        $producto = $productModel->find($product_id);