app/Controllers/CarritoController.php

SELECT *
FROM `cart_item`
WHERE `user_id` = '11'
AND `product_id` = '3'
 LIMIT 1
INSERT INTO `cart_item` (`user_id`, `product_id`, `quantity`) VALUES ('11', '3', 1)
---
    public function agregar()
    {
        $product_id = $this->request->getPost('product_id');
        $quantity = $this->request->getPost('quantity');

        $user_id = session()->get('user_id');

        $cartModel = new CartItemModel();

        // Si el producto ya está en el carrito, actualizar cantidad
        $item = $cartModel->where('user_id', $user_id)
                          ->where('product_id', $product_id)
                          ->first();

        if ($item) {
            $cartModel->update($item['cart_item_id'], [
                'quantity' => $item['quantity'] + $quantity
            ]);
        } else {
            $cartModel->insert([
                'user_id' => $user_id,
                'product_id' => $product_id,
                'quantity' => $quantity
            ]);

SELECT *
FROM `cart_item`
WHERE `user_id` = '7'
AND `product_id` = '2'
 LIMIT 1
UPDATE `cart_item` SET `quantity` = 4
WHERE `cart_item`.`cart_item_id` IN ('5')
---
    public function sumar()
{
    $product_id = $this->request->getPost('product_id');
    $user_id = session()->get('user_id');

    $cartModel = new \App\Models\CartItemModel();
    $productModel = new \App\Models\ProductModel();

    // Traer el item del carrito
    $item = $cartModel->where('user_id', $user_id)
                      ->where('product_id', $product_id)
                      ->first();

    // Traer el producto para conocer el stock
    $producto = $productModel->find($product_id);

    if ($item && $producto) {
        $cantidadActual = $item['quantity'];
        $stockDisponible = $producto['stock'];

        // Si la cantidad en carrito es menor al stock, se permite sumar
        if ($cantidadActual < $stockDisponible) {
            $cartModel->update($item['cart_item_id'], [
                'quantity' => $cantidadActual + 1
            ]);

SELECT *
FROM `cart_item`
WHERE `user_id` = '7'
AND `product_id` = '2'
 LIMIT 1
UPDATE `cart_item` SET `quantity` = 3
WHERE `cart_item`.`cart_item_id` IN ('5')
UPDATE `cart_item` SET `quantity` = '1'
WHERE `cart_item`.`cart_item_id` IN ('5')
---
    public function restar()
    {
        $product_id = $this->request->getPost('product_id');
        $user_id = session()->get('user_id');
        $cartModel = new \App\Models\CartItemModel();

        $item = $cartModel->where('user_id', $user_id)
                        ->where('product_id', $product_id)
                        ->first();

        if ($item && $item['quantity'] > 1) {
            $cartModel->update($item['cart_item_id'], [
                'quantity' => $item['quantity'] - 1
            ]);
        } elseif ($item) {
            $cartModel->update($item['cart_item_id'], [
                'quantity' => $item['quantity']
            ]);

SELECT *
FROM `cart_item`
WHERE `user_id` = '7'
AND `product_id` = '7'
 LIMIT 1
DELETE FROM `cart_item`
WHERE `cart_item_id` IN ('24')
---
    public function eliminar()
    {
        $product_id = $this->request->getPost('product_id');
        $user_id = session()->get('user_id');
        $cartModel = new \App\Models\CartItemModel();

        $item = $cartModel->where('user_id', $user_id)
                        ->where('product_id', $product_id)
                        ->first();

        if ($item) {
            $cartModel->delete($item['cart_item_id']);