app/Controllers/CatalogoController.php

SELECT *
FROM `product`
WHERE `deleted_at` IS NULL
AND  `name` LIKE '%manual%' ESCAPE '!'
AND `product`.`deleted_at` IS NULL
SELECT *
FROM `category`
---
    public function index()
    {
        $productModel = new ProductModel();
        $categoriaModel = new CategoryModel();

        $busqueda = $this->request->getGet('busqueda');
        $categoria = $this->request->getGet('categoria');
        $precio = $this->request->getGet('precio');

        $builder = $productModel->where('deleted_at', null);

        if ($busqueda) {
            $builder->like('name', $busqueda);
        }

        if ($categoria) {
            $builder->where('category_id', $categoria);
        }

        if ($precio == 'menos10000') {
            $builder->where('price <', 10000);
        } elseif ($precio == 'entre10000y50000') {
            $builder->where('price >=', 10000)->where('price <=', 50000);
        } elseif ($precio == 'mas50000') {
            $builder->where('price >', 50000);
        }

        $productos = $builder->findAll();
        $categorias = $categoriaModel->findAll();

SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
AND `product`.`product_id` = '2'
---
    public function catalogoDetalle($id)
    {
        $productoModel = new ProductModel();
        $producto = $productoModel->find($id);