app/Controllers/CheckoutController.php

    public function guardarPago()
    {
        $cartModel = new CartItemModel;
        if (!session()->has('user_id')) {
            return redirect()->to('login')->with('error', 'Debes iniciar sesión para continuar.');
        }

        $session = session();
        $user_id = $session->get('user_id');
        $carrito = $cartModel->where('user_id', $user_id)->findAll();
        $productos = [];
        $subtotal = 0;

        foreach ($carrito as $item) {
            $prod = (new ProductModel())->find($item['product_id']);
---
SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
AND `product`.`product_id` = '3'