app/Controllers/CheckoutController.php

    public function confirmarPedido()
    {
        // Verificar login
        if (!session()->has('user_id')) {
            return redirect()->to('login')->with('error', 'Debes iniciar sesión para confirmar el pedido.');
        }

        $user_id = session('user_id');
        $carritoModel = new CartItemModel();
        $productoModel = new ProductModel();

        $carrito = $carritoModel->where('user_id', $user_id)->findAll();
        $productos = [];
        $subtotal = 0;

        foreach ($carrito as $item) {
            $prod = $productoModel->find($item['product_id']);
---
SELECT *
FROM `cart_item`
WHERE `user_id` = '11'
SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
AND `product`.`product_id` = '3'