app/Controllers/ConsultasController.php

SELECT *
FROM `inquiry`
WHERE `deleted_at` IS NULL
AND `inquiry`.`deleted_at` IS NULL
SELECT *
FROM `contact`
WHERE `deleted_at` IS NULL
AND `contact`.`deleted_at` IS NULL
---
    public function index()
    {
        $inquiryModel = new InquiryModel();
        $contactModel = new ContactModel();

        $inquiries = $inquiryModel->where('deleted_at', null)->findAll();
        $contacts  = $contactModel->where('deleted_at', null)->findAll();