app/Controllers/FacturasController.php

SELECT `i`.*, `u`.`fname`, `u`.`lname`, SUM(ii.quantity) as cantidad_productos
FROM `invoice` `i`
JOIN `user` `u` ON `i`.`user_id` = `u`.`user_id`
JOIN `invoice_item` `ii` ON `i`.`invoice_id` = `ii`.`invoice_id`
GROUP BY `i`.`invoice_id`
ORDER BY `i`.`total` ASC
---
    public function index()
    {
        $orden = $this->request->getGet('orden'); // capturar filtro del select
        $db = \Config\Database::connect();

        // Determinar columna y dirección de ordenamiento
        switch ($orden) {
            case 'reciente':
                $orderBy = ['i.created_at', 'DESC'];
                break;
            case 'antiguo':
                $orderBy = ['i.created_at', 'ASC'];
                break;
            case 'mayor':
                $orderBy = ['i.total', 'DESC'];
                break;
            case 'menor':
                $orderBy = ['i.total', 'ASC'];
                break;
            default:
                $orderBy = ['i.created_at', 'DESC']; // por defecto más reciente
        }

        $facturas = $db->table('invoice i')
            ->select('i.*, u.fname, u.lname, SUM(ii.quantity) as cantidad_productos')
            ->join('user u', 'i.user_id = u.user_id')
            ->join('invoice_item ii', 'i.invoice_id = ii.invoice_id')
            ->groupBy('i.invoice_id')
            ->orderBy($orderBy[0], $orderBy[1])
            ->get()
            ->getResultArray();