app/Controllers/InventarioController.php

SELECT `product`.*, `category`.`category_name` as `categoria`
FROM `product`
JOIN `category` ON `product`.`category_id` = `category`.`category_id`
WHERE `product`.`deleted_at` IS NOT NULL
---
    public function eliminados()
    {
        $productoModel = new \App\Models\ProductModel();
        $productosEliminados = $productoModel
        ->select('product.*, category.category_name as categoria')
        ->join('category', 'product.category_id = category.category_id')
        ->onlyDeleted()
        ->findAll();