app/Controllers/PerfilController.php

    public function index()
    {
        if (!session()->has('user_id')) return redirect()->to('/login');
        $userModel = new UserModel();
        $usuario = $userModel->find(session('user_id'));
---
SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`user_id` = '7'

    public function editar()
    {
        $userModel = new UserModel();
        $usuario = $userModel->find(session('user_id'));
---
SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`user_id` = '7'

    public function verPedido($id)
    {
        $db = \Config\Database::connect();
        $user_id = session('user_id');

        $factura = $db->table('invoice')
            ->where('invoice_id', $id)
            ->where('user_id', $user_id)
            ->get()->getRowArray();

        if (!$factura) {
            return redirect()->to('perfil/pedidos')->with('error', 'Pedido no encontrado.');
        }

        $productos = $db->table('invoice_item ii')
            ->select('ii.*, p.name, p.image, p.description')
            ->join('product p', 'ii.product_id = p.product_id')
            ->where('ii.invoice_id', $id)
            ->get()->getResultArray();
---
SELECT *
FROM `invoice`
WHERE `invoice_id` = '217'
AND `user_id` = '8'
SELECT `ii`.*, `p`.`name`, `p`.`image`, `p`.`description`
FROM `invoice_item` `ii`
JOIN `product` `p` ON `ii`.`product_id` = `p`.`product_id`
WHERE `ii`.`invoice_id` = '217'