app/Controllers/UsuariosController.php

    public function index()
    {
        $usuarioModel = new UserModel();

        $usuarios = $usuarioModel->where('deleted_at', null)->findAll();

        $total_admins = $usuarioModel->where('role', 'admin')->where('deleted_at', null)->countAllResults();
        $total_users = $usuarioModel->where('role', 'user')->where('deleted_at', null)->countAllResults();
---
SELECT *
FROM `user`
WHERE `deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'admin'
AND `deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'user'
AND `deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL