app/Models/CategoryModel.php

    public function getCategoriasConConteo()
    {
        return $this->select('category.*, COUNT(product.product_id) as total_productos')
                    ->join('product', 'product.category_id = category.category_id', 'left')
                    ->groupBy('category.category_id')
                    ->findAll();
---
SELECT `category`.*, COUNT(product.product_id) as total_productos
FROM `category`
LEFT JOIN `product` ON `product`.`category_id` = `category`.`category_id`
GROUP BY `category`.`category_id`