app/Models/ProductModel.php

    public function getMasVendidos($limite = 6)
    {
        return $this->db->table('invoice_item ii')
            ->select('p.*, SUM(ii.quantity) as total_vendidos')
            ->join('product p', 'ii.product_id = p.product_id')
            ->where('p.deleted_at', null)
            ->groupBy('ii.product_id')
            ->orderBy('total_vendidos', 'DESC')
            ->limit($limite)
            ->get()
            ->getResultArray();
---
SELECT `p`.*, SUM(ii.quantity) as total_vendidos
FROM `invoice_item` `ii`
JOIN `product` `p` ON `ii`.`product_id` = `p`.`product_id`
WHERE `p`.`deleted_at` IS NULL
GROUP BY `ii`.`product_id`
ORDER BY `total_vendidos` DESC
 LIMIT 6