app/Views/detalle_producto.php

SELECT *
FROM `cart_item`
WHERE `user_id` = '7'
AND `product_id` = '2'
 LIMIT 1
---
                <?php if (session()->get('isLoggedIn')): ?>
                    <?php
                        $cartModel = new \App\Models\CartItemModel();
                        $cartItem = $cartModel->where('user_id', session('user_id'))
                                              ->where('product_id', $producto['product_id'])
                                              ->first();